Repository: witchcraft2001/testapp
Catalog: lib/l10n/intl_*.arb
Languages: ru

# btnApprove
source: Approve
ru: Утвердить

# btnBack
source: Back
ru: Назад

# btnBackToMain
source: Go back to main
ru: Вернуться на главную

# btnCancel
source: Cancel
ru: Отменить

# btnClose
source: Close
ru: Закрыть

# btnConfirm
source: Confirm
ru: Подтвердить

# btnDone
source: Done
ru: Готово

# btnLogin
source: Log in
ru: Войти

# btnLogout
source: Logout
ru: Выйти

# btnRefresh
source: Refresh
ru: Обновить

# btnReject
source: Reject
ru: Отклонить

# btnRemove
source: Remove
ru: Удалить

# btnRetry
source: Retry
ru: Повторить

# btnSave
source: Save
ru: Сохранить

# btnSelectAll
source: Select all
ru: Выбрать все

# btnSend
source: Send
ru: Отправить

# btnShare
source: Share
ru: Поделиться

# timerSeconds
source: s
ru: сек

# megabytes
source: MB
ru: Мбайт

# kilobytes
source: kB
ru: Кбайт

source: Location
ru: Локация

source: First name
ru: Имя

source: Last name
ru: Фамилия

source: Company
ru: Компания

source: Position
ru: Должность

# mobilePhone
source: Phone
ru: Мобильный телефон

# validationRequired
source: Required field
ru: Обязательное поле

# validationRequiredComment
source: Please, enter a comment
ru: Пожалуйста, введите комментарий

source: Main
ru: Главная

# unknownRoute
source: Page not found
ru: Такой страницы нет

# chatNewMessage
source: Write your message
ru: Напишите ваше сообщение

# chatNoShow
source: Chat unavailable
ru: Чат недоступен

source: Tasks
ru: Задачи

# tasksEas
source: Payment requests
ru: Заявки на оплату

# tasksEasSearch
source: Search by ID or initiator
ru: Поиск по ID или инициатору

# tasksSbsWeekly
source: SBS billing (PM)
ru: Согласование часов (РП)

# tasksSbsLate
source: SBS billing (Thrift-box)
ru: Согласование часов (Копилка)

# tasksSbsCompany
source: Company
ru: Компания

# tasksSbsProject
source: About the project
ru: О проекте

# tasksSbsConfirmMessage
source: Confirm decisions based on employee entered hours?
ru: Подтвердить решения по введенным сотрудниками часам?

# tasksSbsHoursUnpaid
source: Unpaid
ru: Неоплачиваемые

# tasksSbsHoursPaid
source: Paid
ru: Оплачиваемые

# tasksSbsSearch
source: Search by project ID
ru: Поиск по ID проекта

# tasksSbsDelegated
source: Delegated
ru: Делегировано

# tasksVacation
source: Vacation requests
ru: Заявки на отпуск

# tasksVacationSearch
source: Search by employee
ru: Поиск по сотруднику

# tasksSickLeaves
source: Sick leave requests
ru: Заявки на больничный

# taskStatusApproved
source: Approved
ru: Согласовано

# taskStatusRejected
source: Rejected
ru: Отклонено

# taskStatusWaiting
source: Waiting
ru: Отложено

# tasksDecisionComment
source: Comment on your decision
ru: Комментарий к Вашему решению

# taskSendingError
source: Request execution failed, please update the task list and try again later
ru: Выполнение заявки произошло с ошибкой, обновите список задач и попробуйте позже

# tasksEmptyList
source: No active tasks
ru: Нет активных задач

# tasksEmptyListBySearch
source: There are no tasks matching the search parameters
ru: Нет задач, соответствующих параметрам поиска

source: Profile
ru: Профиль

# profileDocuments
source: My documents
ru: Мои документы

# profileDocumentsEmptyList
source: You haven't added any documents yet
ru: Вы еще не добавили ни одного документа

# profileDocumentsBtnAdd
source: Add document
ru: Добавить документ

# profileDocumentsFieldLabelEdit
source: Title of the document
ru: Наименование документа

# profileDocumentsSearch
source: Search documents
ru: Поиск документов

# profileDocumentsSearchNoResults
source: Could not find documents
ru: Не удалось найти документы

# profileDocumentsErrorOpen
source: An error occurred while opening the file
ru: При открытии файла произошла ошибка

# profileDocumentsErrorNoApp
source: There is no application to open the file
ru: Отсутствует приложение для открытия файла

# profileDocumentsDialogRemove
source: Are you sure you want to remove the selected documents?
ru: Вы действительно хотите удалить выбранные документы?

# businessCards
source: My business card
ru: Мои визитные карточки

# businessCardsBtnAdd
source: Add business card
ru: Добавить визитную карточку

# businessCardsEmptyList
source: You don't have business cards yet
ru: У Вас ещё нет визитных карточек

# businessCardsCreate
source: Create card
ru: Создание карточки

# businessCardsEdit
source: Edit card
ru: Редактирование карточки

# businessCardsDialogRemove
source: Are you sure you want to remove the business card?
ru: Вы действительно хотите удалить визитную карточку?

source: Greeting cards
ru: Открытки

# greetingCardsFilling
source: Filling
ru: Наполнение

# greetingCardsPreview
source: Preview
ru: Предпросмотр

# greetingCardsSubject
source: Subject
ru: Тема

# greetingCardsSubjectHint
source: Optional field, e-mail subject
ru: Опциональное поле

# greetingCardsAppeal
source: Appeal
ru: Обращение к получателю

# greetingCardsEmptyList
source: There are no greeting cards available yet
ru: Пока нет доступных открыток

# settings
source: Application settings
ru: Настройки приложения

# settingsLocale
source: Select language
ru: Выберите язык

# settingsRegion
source: Region
ru: Регион

# settingsTheme
source: Theme
ru: Оформление

# settingsThemeAppearance
source: Appearance
ru: Внешний вид

# settingsThemeSystem
source: Set as system
ru: Установить как в системе

# settingsThemeSystemDescription
source: App skin will change based on device appearance
ru: Оформление приложения будет меняться в зависимости от оформления устройства

# settingsNotification
source: Popup notifications
ru: Всплывающие уведомления

# settingsNotificationBilling
source: Wednesday billing reminders
ru: Напоминать о биллинге по средам

# settingsNotificationManage
source: Notification management
ru: Управление уведомлениями

# settingsAboutApp
source: About App
ru: О приложении

# feedbackTitle
source: Feedback
ru: Обратная связь

# feedbackTextLabel
source: Enter a suggestion or comment
ru: Укажите предложение или замечание

# feedbackSendingError
source: There are no email clients configured on the device. Please, add settings and try again
ru: На устройстве отсутствуют настроенные почтовые клиенты. Пожалуйста, добавьте настройки и попробуйте снова

# aboutAppVersion
source: Version: {version}
ru: Версия: {version}

# likesNew
source: Give like
ru: Сказать спасибо

# likesNewMessage
source: Thank a colleague for their help, advice, or collaboration on a project
ru: Поблагодарите коллегу за помощь, совет или совместную работу над проектом

# likesNewDescription
source: Only the person you sent it to will see your comment
ru: Ваш комментарий увидит только тот, кому Вы его направили

# likesNewComment
source: Comment
ru: Комментарий

# likesNewSendingSuccess
source: Like sent
ru: Благодарность отправлена

# likesNewSendingErrorYourself
source: Like can't be sent to yourself
ru: Благодарность нельзя отправить самому себе

# likesMy
source: My likes
ru: Мои благодарности

# likesMyEmptyList
source: It's still empty here
ru: Здесь пока еще пусто

# likesMyEmptyListDescription
source: Don't worry, be happy!
ru: Но не расстраиватесь! Все впереди!

# usersSelect
source: Select an employee
ru: Выберите сотрудника

# usersSearch
source: Search by name
ru: Поиск по ФИО

# usersNotReady
source: Employees unavailable
ru: Список коллег недоступен

# usersSearchNoResults
source: No matching employees found
ru: Не найдено ни одного подходящего коллеги

# usersSearchNoResultsDesc
source: Try changing search query
ru: Попробуйте изменить параметры поиска

# regionFirst
source: Select your region to display news
ru: Выберите Ваш регион для отображения новостей

# regionSecond
source: You can always change it later in your profile
ru: В дальнейшем его всегда можно изменить в профиле

# notificationBilling
source: Billing reminder
ru: Напоминание о биллинге

# notificationBillingMessage
source: Don't forget to deposit all hours worked last week before the end of the day
ru: Не забудьте внести все отработанные на прошлой неделе часы до конца дня

source: Presets
ru: Пресеты

# mockChat
source: assets/jsons/chat_mock_en.json
ru: assets/jsons/chat_mock_ru.json

# mockNewsAssetPath
source: assets/jsons/news_mock_en.json
ru: assets/jsons/news_mock_ru.json

# exceptionUnauthorized
source: Authorization error
ru: Проблема авторизации

# exceptionUnauthorizedDesc
source: Access denied or authentication canceled
ru: Доступ запрещен или аутентификация отменена

# exceptionConnection
source: No internet connection
ru: Отсутствует сетевое соединение

# exceptionExternalServer
source: Service is not available
ru: Сервис недоступен

# exceptionHttpMethod
source: No implementation of the http-method
ru: Отсутствует реализация http-метода

# exceptionRepoUnknownField
source: Unknown field type
ru: Неизвестный тип данных

# exceptionRepoLoading
source: Failed to load
ru: Ошибка получения данных

# exceptionRepoDbInsert
source: Error adding new entry
ru: Ошибка добавления новой записи

# exceptionRepoDbDelete
source: Data clearing error
ru: Ошибка очистки данных

# exceptionRepoChatNotFound
source: Chat is not found
ru: Чат не найден

# exceptionFormat
source: Bad response format
ru: Неправильный формат ответа

# exceptionDioCancel
source: Request was cancelled
ru: Запрос был отменен

# exceptionDioConnectTimeout
source: Timeout to connect
ru: Превышено время соединения

# exceptionDioReceiveTimeout
source: Timeout to receive data
ru: Превышено время получения данных

# exceptionDioSendTimeout
source: Timeout to send data
ru: Превышено время отправки данных

# exceptionDioResponse
source: Incorrect server response status
ru: Неправильный статус ответа сервиса

# exceptionSomethingWasWrong
source: Something was wrong...
ru: Что-то пошло не так...
